#Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

def sum_numbers(a, b):
    if a ==0:
        return b
    return sum_numbers(a-1, b+1)

q = int(input())
g = int(input())

print(sum_numbers(q, g))